# -*- coding: utf-8 -*-
#+STARTUP: overview indent inlineimages
#+TITLE:       Laboratory Notebook for a Multi-Threaded Version of Quicksort
#+AUTHOR:      Arnaud Legrand
#+LANGUAGE:    en
#+TAGS: IMPORTANT(i) TEST(t) DEPRECATED(d) noexport(n)

** data/
This is where raw experimental data should go. Each directory entry
comprises a set of experiments and the directory name is based on the
machine name and on the date. For example:
#+begin_src sh :results output :exports both 
echo mkdir data/`hostname`_`date +%F`
#+end_src

#+RESULTS:
: mkdir data/sama_2014-10-13

** Compilation
A simple makefile with various compilation options is provided in the
src/ directory. Compilation is thus done by running the following command:
#+begin_src sh :results output :exports both 
make -C src/
#+end_src

#+RESULTS:
: make: Entering directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  -c -o parallelQuicksort.o parallelQuicksort.c
: cc   -g -Wall -Wshadow -Wcast-align -Waggregate-return -Wmissing-prototypes -Wmissing-declarations -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations -Wmissing-noreturn -Wpointer-arith -Wwrite-strings -finline-functions -O0 -pthread -lrt -std=c99  parallelQuicksort.o  -o parallelQuicksort 
: make: Leaving directory '/home/alegrand/Work/Documents/Enseignements/M2R_Eval_Perf_13/M2R-ParallelQuicksort/src'

*** Initial code design
- I obtained an initial implementation from
  http://sc12.supercomputing.org/hpceducator/PythonForParallelism/codes/parallelQuicksort.c.
  According to the header, the original author is Joshua Stough from
  Washington and Lee University. I hope he will not mind that I reuse
  this piece of code for educational purposes.
- Here is a typical first execution on my laptop (an Intel(R) Core(TM)
  i7 running a Debian with Linux 3.14.15):
  #+begin_src sh :results output :exports both 
    ./src/quicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.231571 sec.
  : at loc 506315, 5.068226e-01 < 5.068269e-01 
  : Oops, lyst did not get sorted by parallelQuicksort.
  : Parallel quicksort took: 0.161259 sec.
  : Built-in qsort took: 0.241568 sec.

  Sweet, in my first attempt, it looks like this parallel version is
  indeed running faster than then sequential one. I have to say this
  warning message is stressing me a bit though.
- On smaller instances, the code would segfault. So I reindented the
  code and thanks to valgrind and gdb, I could find what was wrong. I
  also renamed the file so that compiling is more convenient. This
  fixed the previous warning message so now everything seems fine:
  #+begin_src sh :results output :exports both 
    ./src/parallelQuicksort
  #+end_src

  #+RESULTS:
  : Sequential quicksort took: 0.239347 sec.
  : Parallel quicksort took: 0.176365 sec.
  : Built-in quicksort took: 0.244716 sec.

**** Calculate average

#+begin_src R :results output :session :exports both
df %>%
    group_by(Host, Size, Strategy) %>%
    summarize(N=n(),
              Mean = mean(Time),
              SD = sd(Time),
              SE = 3*SD/sqrt(n())) %>%
    filter(Size == 100000000) -> p;
p;
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 18 x 7
# Groups:   Host, Size [6]
     Host      Size   Strategy     N     Mean         SD         SE
    <chr>     <int>      <chr> <int>    <dbl>      <dbl>      <dbl>
 1 blaise 100000000   Built-in     5 27.44535 0.30598272 0.41051890
 2 blaise 100000000   Parallel     5 30.64253 1.31488330 1.76410107
 3 blaise 100000000 Sequential     5 26.44270 0.36203074 0.48571521
 4 draco6 100000000   Built-in     1 42.42106         NA         NA
 5 draco6 100000000   Parallel     1 38.15311         NA         NA
 6 draco6 100000000 Sequential     1 39.20502         NA         NA
 7  hype4 100000000   Built-in     5 31.93189 0.04884568 0.06553336
 8  hype4 100000000   Parallel     5 34.56596 0.49474631 0.66377183
 9  hype4 100000000 Sequential     5 31.61215 0.30135966 0.40431641
10  jequi 100000000   Built-in     5 25.12940 0.33461624 0.44893480
11  jequi 100000000   Parallel     5 14.36284 0.17969110 0.24108091
12  jequi 100000000 Sequential     5 24.30120 0.12516626 0.16792817
13 orion3 100000000   Built-in     5 39.58521 0.40100193 0.53800054
14 orion3 100000000   Parallel     5 37.51002 0.55632644 0.74639025
15 orion3 100000000 Sequential     5 36.00592 0.52749020 0.70770237
16   tupi 100000000   Built-in     5 45.90893 0.01085338 0.01456134
17   tupi 100000000   Parallel     5 27.42951 0.41426960 0.55580099
18   tupi 100000000 Sequential     5 45.32739 0.36440582 0.48890171
#+end_example

